app/controllers/form24_games_controller.rb

SELECT "form24_games".* FROM "form24_games" WHERE "form24_games"."id" = 1 LIMIT 1
---
  def show
    @game = Form24Game.find_by(id: params[:id])

SELECT "form24_games".* FROM "form24_games" WHERE "form24_games"."id" = 1 LIMIT 1
---
  def validate
    @game = Form24Game.find_by(id: params[:id])

SELECT "form24_games".* FROM "form24_games" WHERE "form24_games"."id" = 15 LIMIT 1
---
  def new_hand
    @game = Form24Game.find_by(id: params[:id])

SELECT "form24_games".* FROM "form24_games" WHERE "form24_games"."id" = 16 LIMIT 1
---
  def draw
    @game = Form24Game.find_by(id: params[:id])